import random
import math

def main():  

    #至诚无息之时
    h = seek_a_hexagram()
    
    print("\n" , "卦：", h[0] , "，动爻：", h[1],'爻', "\n" )
    
    input('Press <Enter> to exit')
    
def seek_a_hexagram():
    hexagrams = [
        '乾',
        '夬',
        '大有',
        '大壮',
        '小畜',
        '需',
        '大畜',
        '泰',
        '履',
        '兑',
        '睽',
        '归妹',
        '中孚',
        '节',
        '损',
        '临',
        '同人',
        '革',
        '离',
        '丰',
        '家人',
        '既济',
        '贲',
        '明夷',
        '无妄',
        '随',
        '噬盍',
        '震',
        '益',
        '屯',
        '颐',
        '复',
        '姤',
        '大过',
        '鼎',
        '恒',
        '巽',
        '井',
        '蛊',
        '升',
        '讼',
        '困',
        '未济',
        '解',
        '涣',
        '坎',
        '蒙',
        '师',
        '遁',
        '咸',
        '旅',
        '小过',
        '渐',
        '蹇',
        '艮',
        '谦',
        '否',
        '萃',
        '晋',
        '豫',
        '观',
        '比',
        '剥',
        '坤'
        ]

    #人以至诚皆能通神
    n = random.randint(1,384)
    
    y = [
        '上',
        '初',
        '二',
        '三',
        '四',
        '五'    
    ]
    
    return (hexagrams[math.ceil(n/6) - 1],y[n % 6])
    
if __name__ == "__main__":
    main()
