import random
import math

def main():  

    #至诚无息之时
    h = seek_a_hexagram()
        
    print("\n" , "卦：", h[0] , "，动爻：", h[1],'爻', "\n" )
    
    input('Press <Enter> to exit')
    
def seek_a_hexagram():
    hexagrams = [
        '乾为天',
        '泽天夬',
        '火天大有',
        '雷天大壮',
        '风天小畜',
        '水天需',
        '山天大畜',
        '地天泰',
        '天泽履',
        '兑为泽',
        '火泽睽',
        '雷泽归妹',
        '风泽中孚',
        '水泽节',
        '山泽损',
        '地泽临',
        '天火同人',
        '泽火革',
        '离为火',
        '雷火丰',
        '风火家人',
        '水火既济',
        '山火贲',
        '地火明夷',
        '天雷无妄',
        '泽雷随',
        '火雷噬嗑',
        '震为雷',
        '风雷益',
        '水雷屯',
        '山雷颐',
        '地雷复',
        '天风姤',
        '泽风大过',
        '火风鼎',
        '雷风恒',
        '巽为风',
        '水风井',
        '山风蛊',
        '地风升',
        '天水讼',
        '泽水困',
        '火水未济',
        '雷水解',
        '风水涣',
        '坎为水',
        '山水蒙',
        '地水师',
        '天山遁',
        '泽山咸',
        '火山旅',
        '雷山小过',
        '风山渐',
        '水山蹇',
        '艮为山',
        '地山谦',
        '天地否',
        '泽地萃',
        '火地晋',
        '雷地豫',
        '风地观',
        '水地比',
        '山地剥',
        '坤为地'
        ]

    #人以至诚皆能通神
    n = random.randint(1,384)

    #if n % 6 == 0:
    #    y = '上'
    #elif n % 6 == 1:
    #    y = '初'
    #else:
    #   y = n % 6
    
    y = [
        '上',
        '初',
        '二',
        '三',
        '四',
        '五'    
    ]
    
    return (hexagrams[math.ceil(n/6) - 1],y[n % 6])
    
if __name__ == "__main__":
    main()
